<?xml version="1.0"?>
<net name="torch-jit-export" version="11">
	<layers>
		<layer id="0" name="images" type="Parameter" version="opset1">
			<data shape="1,3,416,640" element_type="f32" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="f16" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="images">
					<dim>1</dim>
					<dim>3</dim>
					<dim>416</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="0.model.22.ia.0.implicit_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 40, 1, 1" offset="0" size="80" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="0.model.22.ia.0.implicit" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="0.model.22.ia.0.implicit,onnx::Add_808">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="0.model.0.stem_1.conv.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 3, 3, 3" offset="80" size="864" />
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="0.model.0.stem_1.conv.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="0.model.0.stem_1.conv.weight">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Conv_0/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>416</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>208</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Reshape_246_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="944" size="32" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Reshape_246" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Conv_0" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>208</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="onnx::Sigmoid_409">
					<dim>1</dim>
					<dim>16</dim>
					<dim>208</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Mul_2" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>208</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="input">
					<dim>1</dim>
					<dim>16</dim>
					<dim>208</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="0.model.0.stem_2a.conv.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="8, 16, 1, 1" offset="976" size="256" />
			<output>
				<port id="0" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="0.model.0.stem_2a.conv.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>8</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="0.model.0.stem_2a.conv.weight">
					<dim>8</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Conv_3/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>208</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>208</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Reshape_296_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 8, 1, 1" offset="1232" size="16" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Reshape_296" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Conv_3" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>208</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="onnx::Sigmoid_412">
					<dim>1</dim>
					<dim>8</dim>
					<dim>208</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Mul_5" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>208</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="input.4">
					<dim>1</dim>
					<dim>8</dim>
					<dim>208</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="0.model.0.stem_2b.conv.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 8, 3, 3" offset="1248" size="2304" />
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>8</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="0.model.0.stem_2b.conv.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>8</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="0.model.0.stem_2b.conv.weight">
					<dim>16</dim>
					<dim>8</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Conv_6/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>208</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>8</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Reshape_346_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="3552" size="32" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Reshape_346" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Conv_6" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="onnx::Sigmoid_415">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Mul_8" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Concat_417">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="MaxPool_9" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="ceil" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>208</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Concat_418">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>160</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Concat_10" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.8">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="0.model.0.stem_3.conv.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 32, 1, 1" offset="3584" size="1024" />
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="0.model.0.stem_3.conv.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="0.model.0.stem_3.conv.weight">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Conv_11/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Reshape_398_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="4608" size="32" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Reshape_398" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Conv_11" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="onnx::Sigmoid_420">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Mul_13" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="input.12">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Reshape_435_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 1, 1, 3, 3" offset="4640" size="288" />
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Reshape_435" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Conv_14/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>52</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Reshape_521_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="4928" size="32" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Reshape_521" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Conv_14" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>52</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.20">
					<dim>1</dim>
					<dim>16</dim>
					<dim>52</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="onnx::Conv_1904_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="20, 16, 1, 1" offset="4960" size="640" />
			<output>
				<port id="0" precision="FP16">
					<dim>20</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="onnx::Conv_1904" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>20</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_1904">
					<dim>20</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Conv_15/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>52</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>20</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>52</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Reshape_569_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 20, 1, 1" offset="5600" size="40" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Reshape_569" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Conv_15" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>52</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.28">
					<dim>1</dim>
					<dim>20</dim>
					<dim>52</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Mul_17" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>52</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Concat_428">
					<dim>1</dim>
					<dim>20</dim>
					<dim>52</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="onnx::Conv_1907_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="20, 16, 1, 1" offset="5640" size="640" />
			<output>
				<port id="0" precision="FP16">
					<dim>20</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="onnx::Conv_1907" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>20</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_1907">
					<dim>20</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Conv_18/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>20</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>104</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Reshape_619_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 20, 1, 1" offset="6280" size="40" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Reshape_619" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Conv_18" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>104</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.36">
					<dim>1</dim>
					<dim>20</dim>
					<dim>104</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Mul_20" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>104</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_432">
					<dim>1</dim>
					<dim>20</dim>
					<dim>104</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Reshape_656_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="20, 1, 1, 3, 3" offset="6320" size="360" />
			<output>
				<port id="0" precision="FP16">
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Reshape_656" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Conv_21/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>104</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>52</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Reshape_742_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 20, 1, 1" offset="6680" size="40" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Reshape_742" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Conv_21" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>52</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.44">
					<dim>1</dim>
					<dim>20</dim>
					<dim>52</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="onnx::Conv_1913_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="20, 20, 1, 1" offset="6720" size="800" />
			<output>
				<port id="0" precision="FP16">
					<dim>20</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="onnx::Conv_1913" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>20</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_1913">
					<dim>20</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Conv_22/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>52</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>20</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>52</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Reshape_790_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 20, 1, 1" offset="7520" size="40" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Reshape_790" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Conv_22" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>52</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.52">
					<dim>1</dim>
					<dim>20</dim>
					<dim>52</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Mul_24" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>52</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Concat_438">
					<dim>1</dim>
					<dim>20</dim>
					<dim>52</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Concat_25" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>52</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>52</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="out">
					<dim>1</dim>
					<dim>40</dim>
					<dim>52</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Constant_26" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="7560" size="40" />
			<output>
				<port id="0" precision="I64" names="onnx::Reshape_440">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Reshape_27" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>52</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="onnx::Transpose_441">
					<dim>1</dim>
					<dim>2</dim>
					<dim>20</dim>
					<dim>52</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Constant_828" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="7600" size="40" />
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Transpose_28" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>20</dim>
					<dim>52</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="onnx::Reshape_442">
					<dim>1</dim>
					<dim>20</dim>
					<dim>2</dim>
					<dim>52</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Constant_29" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="7640" size="32" />
			<output>
				<port id="0" precision="I64" names="onnx::Reshape_443">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Reshape_30" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>2</dim>
					<dim>52</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="onnx::Shape_444">
					<dim>1</dim>
					<dim>40</dim>
					<dim>52</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Constant_56156" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="7672" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Constant_56157" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="7672" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Constant_56153" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="7688" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Shape_31" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>52</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="onnx::Gather_445">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Constant_32" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="7688" size="8" />
			<output>
				<port id="0" precision="I64" names="onnx::Gather_446">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Constant_839" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="7696" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="79" name="Gather_33" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="onnx::Add_447">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Constant_35" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="7688" size="8" />
			<output>
				<port id="0" precision="I64" names="onnx::Add_449">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Add_36" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="onnx::Div_450">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Constant_37" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="7704" size="8" />
			<output>
				<port id="0" precision="I64" names="onnx::Div_451">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Div_38" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="onnx::Mul_452,onnx::Slice_454">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Constant_56152" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="7712" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="ScatterUpdate_56158" type="ScatterUpdate" version="opset3">
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Constant_56161" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="7716" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Slice_41" type="StridedSlice" version="opset1">
			<data begin_mask="1, 0" end_mask="1, 0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>52</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="onnx::Concat_455">
					<dim>1</dim>
					<dim>20</dim>
					<dim>52</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Constant_56225" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="7672" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Constant_56224" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="7688" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Constant_56223" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="7712" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="ScatterUpdate_56226" type="ScatterUpdate" version="opset3">
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Constant_56227" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="7672" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Constant_42" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="7704" size="8" />
			<output>
				<port id="0" precision="I64" names="onnx::Mul_456">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Mul_43" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="onnx::Slice_457">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="ScatterUpdate_56228" type="ScatterUpdate" version="opset3">
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Constant_56231" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="7716" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Slice_44" type="StridedSlice" version="opset1">
			<data begin_mask="1, 0" end_mask="1, 0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>52</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="onnx::Conv_458">
					<dim>1</dim>
					<dim>20</dim>
					<dim>52</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="onnx::Conv_1916_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="20, 20, 1, 1" offset="7732" size="800" />
			<output>
				<port id="0" precision="FP16">
					<dim>20</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="onnx::Conv_1916" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>20</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_1916">
					<dim>20</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Conv_45/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>52</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>20</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>52</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Reshape_1005_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 20, 1, 1" offset="8532" size="40" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Reshape_1005" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Conv_45" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>52</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.60">
					<dim>1</dim>
					<dim>20</dim>
					<dim>52</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Mul_47" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>52</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_462">
					<dim>1</dim>
					<dim>20</dim>
					<dim>52</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Reshape_1042_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="20, 1, 1, 3, 3" offset="8572" size="360" />
			<output>
				<port id="0" precision="FP16">
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Reshape_1042" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Conv_48/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>52</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>52</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Reshape_1128_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 20, 1, 1" offset="8932" size="40" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Reshape_1128" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Conv_48" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>52</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="input.68">
					<dim>1</dim>
					<dim>20</dim>
					<dim>52</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="onnx::Conv_1922_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="20, 20, 1, 1" offset="8972" size="800" />
			<output>
				<port id="0" precision="FP16">
					<dim>20</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="onnx::Conv_1922" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>20</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::Conv_1922">
					<dim>20</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Conv_49/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>52</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>20</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>52</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Reshape_1176_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 20, 1, 1" offset="9772" size="40" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Reshape_1176" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Conv_49" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>52</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
